"use strict"

// Числа-------------------------------------------------------------------------
let number=5
console.log(4/0) // результат infinity то-есть бесконечность
console.log('Vova'*7) // результата NaN нот э намбер (не число)

//Строки-------------------------------------------------------------------------
const person='Vladimir'

// Boolean-------------------------------------------------------------------------
const bool1=true
const bool2=false

// Объект-------------------------------------------------------------------------
const obj={
    name: 'Vladimir',
    age: 36,
    isMarried: false
}

//console.log(obj.name)  //еще один вариант записи
console.log(obj['name'])

// Массив-------------------------------------------------------------------------
const array=['ГИБДД','ПермДор','ФСС']
console.log(array[1])
